using System.Collections.Generic;

namespace Coslen.RogueTiler.Domain.Engine.Common
{
    public enum AsciiKeys
    {
        None = 0,
        WallCornerSE = 218,
        WallNS = 179,
        WallCornerNE = 192,
        WallEW = 196,
        WallCornerSW = 191,
        WallCornerNW = 217,
        WallTW = 180,
        WallTE = 195,
        WallTS = 194,
        WallTN = 193,
        WallCross = 197,
        WallColumn = 206
    }

    public class ASCII
    {
        private Dictionary<int, string> ascii;


        public ASCII()
        {
            Setup();
        }

        public string this[AsciiKeys source]
        {
            get { return ascii[(int) source]; }
        }

        public string this[int source]
        {
            get { return ascii[source]; }
        }

        private void Setup()
        {
            ascii = new Dictionary<int, string>
            {
                {128, "Ç"}, {129, "ü"},
                { 130, "é"}, {131, "â"}, {132, "ä"}, {133, "à"}, {134, "å"}, {135, "ç"}, {136, "ê"}, {137, "ë"}, {138, "è"}, {139, "ï"},
                { 140, "î"}, {141, "ì"}, {142, "Ä"}, {143, "Å"}, {144, "É"}, {145, "æ"}, {146, "Æ"}, {147, "ô"}, {148, "ö"}, {149, "ò"},
                { 150, "û"}, {151, "ù"}, {152, "ÿ"}, {153, "Ö"}, {154, "Ü"}, {155, "ø"}, {156, "£"}, {157, "Ø"}, {158, "×"}, {159, "ƒ"},
                { 160, "á"}, {161, "í"}, {162, "ó"}, {163, "ú"}, {164, "ñ"}, {165, "Ñ"}, {166, "ª"}, {167, "º"}, {168, "¿"}, {169, "®"},
                { 179, "│"}, {180, "┤"}, {181, "Á"}, {182, "Â"}, {183, "À"}, {184, "©"}, {185, "╣"}, {186, "║"}, {187, "╗"}, {188, "╝"},
                { 189, "¢"}, {190, "¥"}, {191, "┐"}, {192, "└"}, {193, "┴"}, {194, "┬"}, {195, "├"}, {196, "─"}, {197, "┼"}, {198, "ã"},
                { 199, "Ã"}, {200, "╚"}, {201, "╔"}, {202, "╩"}, {203, "╦"}, {204, "╠"}, {205, "═"}, {206, "╬"}, {207, "¤"}, {208, "ð"},
                { 209, "Ð"}, {210, "Ê"}, {211, "Ë"}, {212, "È"}, {213, "ı"}, {214, "Í"}, {215, "Î"}, {216, "Ï"}, {217, "┘"}, {218, "┌"},
                { 219, "█"}
            };
        }
    }
}